In [2]:

import pandas as pd
from sklearn import linear_model
from word2number import w2n

ModuleNotFoundError: No module named 'pandas'

In [3]:
pip install numpy

Collecting numpy
  Downloading numpy-1.18.3-cp37-cp37m-win32.whl (10.8 MB)
Installing collected packages: numpy
Successfully installed numpy-1.18.3
Note: you may need to restart the kernel to use updated packages.

In [4]:
pip install pandas

Collecting pandas
  Downloading pandas-1.0.3-cp37-cp37m-win32.whl (7.5 MB)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\lenovo\appdata\local\programs\python\python37-32\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\lenovo\appdata\local\programs\python\python37-32\lib\site-packages (from pandas) (1.18.3)
Collecting pytz>=2017.2
  Downloading pytz-2019.3-py2.py3-none-any.whl (509 kB)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\appdata\local\programs\python\python37-32\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-1.0.3 pytz-2019.3
Note: you may need to restart the kernel to use updated packages.

In [5]:
import numpy as np

In [7]:
pip install word2number

Requirement already satisfied: word2number in c:\users\lenovo\appdata\local\programs\python\python37-32\lib\site-packages (1.1)
Note: you may need to restart the kernel to use updated packages.

In [9]:
pip install sklearn

Requirement already satisfied: sklearn in c:\users\lenovo\appdata\local\programs\python\python37-32\lib\site-packages (0.0)
Requirement already satisfied: scikit-learn in c:\users\lenovo\appdata\local\programs\python\python37-32\lib\site-packages (from sklearn) (0.22.2.post1)
Requirement already satisfied: numpy>=1.11.0 in c:\users\lenovo\appdata\local\programs\python\python37-32\lib\site-packages (from scikit-learn->sklearn) (1.18.3)
Requirement already satisfied: scipy>=0.17.0 in c:\users\lenovo\appdata\local\programs\python\python37-32\lib\site-packages (from scikit-learn->sklearn) (1.4.1)
Requirement already satisfied: joblib>=0.11 in c:\users\lenovo\appdata\local\programs\python\python37-32\lib\site-packages (from scikit-learn->sklearn) (0.14.1)
Note: you may need to restart the kernel to use updated packages.

In [10]:
pip install matplotlib

Collecting matplotlib
  Downloading matplotlib-3.2.1-cp37-cp37m-win32.whl (9.0 MB)
Requirement already satisfied: python-dateutil>=2.1 in c:\users\lenovo\appdata\local\programs\python\python37-32\lib\site-packages (from matplotlib) (2.8.1)
Requirement already satisfied: numpy>=1.11 in c:\users\lenovo\appdata\local\programs\python\python37-32\lib\site-packages (from matplotlib) (1.18.3)
Collecting kiwisolver>=1.0.1
  Downloading kiwisolver-1.2.0-cp37-none-win32.whl (44 kB)
Collecting cycler>=0.10
  Downloading cycler-0.10.0-py2.py3-none-any.whl (6.5 kB)
Collecting pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1Note: you may need to restart the kernel to use updated packages.

  Downloading pyparsing-2.4.7-py2.py3-none-any.whl (67 kB)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\appdata\local\programs\python\python37-32\lib\site-packages (from python-dateutil>=2.1->matplotlib) (1.14.0)
Installing collected packages: kiwisolver, cycler, pyparsing, matplotlib
Successfully installed cycler-0.10.0 kiwisolver-1.2.0 matplotlib-3.2.1 pyparsing-2.4.7

In [11]:
import pandas as pd

In [12]:
from sklearn import linear_model

In [13]:
from word2number import w2n

In [14]:
data_frame = pd.read_csv("exercise.mul_var_linear_regression.csv")

In [15]:
data_frame

  expperience   text _score  interview_score  salary
0          NaN          8.0                9   50000
1          NaN          8.0                6   45000
2         five          6.0                7   60000
3          two         10.0               10   65000
4        seven          9.0                6   70000
5        three          7.0               10   62000
6          ten          NaN                7   72000
7       eleven          7.0                8   80000

In [18]:
data_frame.expperience.fillna("zero")

AttributeError: 'DataFrame' object has no attribute 'expperience'

In [19]:
data_frame.expperience.fillna("zero")

AttributeError: 'DataFrame' object has no attribute 'expperience'

In [20]:
data_frame

  expperience   text _score  interview_score  salary
0          NaN          8.0                9   50000
1          NaN          8.0                6   45000
2         five          6.0                7   60000
3          two         10.0               10   65000
4        seven          9.0                6   70000
5        three          7.0               10   62000
6          ten          NaN                7   72000
7       eleven          7.0                8   80000

In [21]:
d = pd.read_csv("exercise.mul_var_linear_regression.csv")
d

  experience   text _score  interview_score  salary
0         NaN          8.0                9   50000
1         NaN          8.0                6   45000
2        five          6.0                7   60000
3         two         10.0               10   65000
4       seven          9.0                6   70000
5       three          7.0               10   62000
6         ten          NaN                7   72000
7      eleven          7.0                8   80000

In [22]:
d.experience = d.experience.fillna("zero")
d

AttributeError: 'DataFrame' object has no attribute 'experience'

In [23]:
d.salary

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary, dtype: int64

In [24]:
d.experience

AttributeError: 'DataFrame' object has no attribute 'experience'

In [25]:
d.experience

AttributeError: 'DataFrame' object has no attribute 'experience'

In [26]:
d

  experience   text _score  interview_score  salary
0         NaN          8.0                9   50000
1         NaN          8.0                6   45000
2        five          6.0                7   60000
3         two         10.0               10   65000
4       seven          9.0                6   70000
5       three          7.0               10   62000
6         ten          NaN                7   72000
7      eleven          7.0                8   80000

In [27]:
d.text_score

AttributeError: 'DataFrame' object has no attribute 'text_score'

In [28]:
d = pd.read_csv("exercise.mul_var_linear_regression.csv")
d

      exp  score  interview  salary
0     NaN    8.0          9   50000
1     NaN    8.0          6   45000
2    five    6.0          7   60000
3     two   10.0         10   65000
4   seven    9.0          6   70000
5   three    7.0         10   62000
6     ten    NaN          7   72000
7  eleven    7.0          8   80000

In [29]:
d.exp

0       NaN
1       NaN
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: exp, dtype: object

In [30]:
d.interview

0     9
1     6
2     7
3    10
4     6
5    10
6     7
7     8
Name: interview, dtype: int64

In [31]:
d.exp=d.exp.fillna("zero")
d

      exp  score  interview  salary
0    zero    8.0          9   50000
1    zero    8.0          6   45000
2    five    6.0          7   60000
3     two   10.0         10   65000
4   seven    9.0          6   70000
5   three    7.0         10   62000
6     ten    NaN          7   72000
7  eleven    7.0          8   80000

In [33]:
d.exp = d.exp.apply(w2n.word_to_num)
d

   exp  score  interview  salary
0    0    8.0          9   50000
1    0    8.0          6   45000
2    5    6.0          7   60000
3    2   10.0         10   65000
4    7    9.0          6   70000
5    3    7.0         10   62000
6   10    NaN          7   72000
7   11    7.0          8   80000

In [34]:
import math

In [41]:
m =math.floor(d.score.mean())

In [42]:
d.score = d.score.fillna(m)

In [43]:
d

   exp  score  interview  salary
0    0    8.0          9   50000
1    0    8.0          6   45000
2    5    6.0          7   60000
3    2   10.0         10   65000
4    7    9.0          6   70000
5    3    7.0         10   62000
6   10    8.0          7   72000
7   11    7.0          8   80000

In [45]:
new_d=d.drop('salary',axis='columns')

In [46]:
new_d

   exp  score  interview
0    0    8.0          9
1    0    8.0          6
2    5    6.0          7
3    2   10.0         10
4    7    9.0          6
5    3    7.0         10
6   10    8.0          7
7   11    7.0          8

In [48]:
reg =linear_model.LinearRegression()

In [49]:
reg.fit(new_d,d.salary)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [50]:
reg.predict([[2,9,6]])

array([53205.96797671])

In [51]:
reg.predict([[12,10,10]])

array([92002.18340611])